Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.GetCoordination
Gets the coordination of the connector
Returns:
The coordination of the connector
Since:
2017

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Profile
The connector profile.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.VelocityPressure
The connector velocity pressure. Units: (kg/(ft·s²)).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Flow
The connector flow, Units:(ft³/s)
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.FlowDirection
the flow direction of this connector, In or Out.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.LinkIndex
the index of the connector which is linked with this connector
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Index
return the index of this connector
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Angle
the angle of the fitting, Units:(rad).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Diameter
The connector diameter, Units:(ft).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Height
The connector height, Units:(ft).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Width
The connector width, Units:(ft).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData
The input data used by external servers for calculation of the duct fitting and duct accessory coefficient.
Remarks:
width, height, diameter, flow, velocity pressure and connector index are input data for the calculation,
Since:
2014